## Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd
d = pd.Series([4,8,15,16,23,42])

In [5]:
d

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [6]:
lst = [1,2,23,4,4,5,56,'Nmae','Happy',8]

In [9]:
pd.Series(lst)

0        1
1        2
2       23
3        4
4        4
5        5
6       56
7     Nmae
8    Happy
9        8
dtype: object

## Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [10]:
Data = {'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['female','male','female']}

In [11]:
df1 = pd.DataFrame(Data)

In [12]:
df1

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

## Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas DataFrame is a 2-dimensional labeled data structure like any table with rows and columns. The size and values of the dataframe are mutable,i.e., can be modified.

Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.).

In [14]:
data = [1,2,3,4]
df2 = pd.Series(data)
print(df2)

0    1
1    2
2    3
3    4
dtype: int64

In [15]:
Data = {'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['female','male','female']}
df3  = pd.DataFrame(Data)
df3

     Name  Age  Gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

## Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

1) read_csv
2) df.head()
3) df[""].dtypes
4) df.fillna()
5) df.columns

In [3]:
df11 = pd.read_csv("Titanic_data.csv")

## Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

-> DataFrame is mutable in nature.Its values and size both can be changed.
-> Series is mutable in nature but only its value can be changed not its size.
-> Panel is mutable in nature.Its value and size both are mutable.

## Q7. Create a DataFrame using multiple Series. Explain with an example.

In [13]:
l1 = [1,2,3]
s1 = pd.Series(l1)

l2 = ["dhruv","jatin","rahul"]
s2 = pd.Series(l2)

l3 = [{"key1":[1,2,3,4]},{"key2":[3,4,5,6]},{"key3":[5,6,7,8]}]
s3 = pd.Series(l3)

d1 = {"d1":s1,"d2":s2,"d3":s3}

In [14]:
df12 = pd.DataFrame(d1)

In [15]:
df12

   d1     d2                      d3
0   1  dhruv  {'key1': [1, 2, 3, 4]}
1   2  jatin  {'key2': [3, 4, 5, 6]}
2   3  rahul  {'key3': [5, 6, 7, 8]}